Repository: some14ever/webwork2
Catalog: lib/WeBWorK/Localize/*.po
Languages: ru_ru

source: %1 (test %2)
ru_ru: %1 (тест %2)

source: %1 sets added, %2 sets skipped. Skipped sets: (%3)
ru_ru: %1 заданий добавлено %2 заданий пропущено. Пропущеные задания: (%3)

source: %1 sets exported, %2 sets skipped. Skipped sets: (%3)
ru_ru: %1 заданий экспортировано, %2 заданий пропущено. Пропущенные задания: (%3)

source: %1 test
ru_ru: %1 тест

source: %1 users exported to file %2/%3
ru_ru: %1 пользователей экспортировано в файл %2/%3

source: %1 users replaced, %2 users added, %3 users skipped. Skipped users: (%4)
ru_ru: %1 пользователей заменено, %2 пользователей добавлено, %3 пользователей пропущено. Пропущенные пользователи: (%4)

source: %1% correct
ru_ru: %1% верно

source: %1's Current Address
ru_ru: Текущий адркс для %1

source: %1's Current Password
ru_ru: Текущий пароль для %1

source: %1's New Address
ru_ru: Новый адрес для %1

source: %1's New Password
ru_ru: Новый пароль для %1

source: %1's new password cannot be blank.
ru_ru: Новый пароль для %1 не может быть пустым.

source: %1's password has been changed.
ru_ru: Новый пароль для %1 установлен.

source: %1: Problem %2
ru_ru: Задание %1: Задача %2

source: %quant(%1,of the questions remains,of the questions remain) unanswered.
ru_ru: %quant (%1,из вопросов остался без ответа,из вопросов остались без ответа,все ответы даны).

source: (This problem will not count towards your grade.)
ru_ru: (Эта задача не будет Вам засчитана.)

source: ANSWERS ONLY CHECKED -- ANSWERS NOT RECORDED
ru_ru: ОТВЕТЫ ПРОВЕРЕНЫ, НО ОНИ НЕ ЗАПИСАНЫ

source: Abandon changes
ru_ru: Не сохранять изменений

source: Abandon export
ru_ru: Не делать экспортирование

source: Acting as %1.
ru_ru: Действуете как %1.

source: Active
ru_ru: Активен

source: Add how many students?
ru_ru: Сколько студентов добавить?

source: Add which new users?
ru_ru: Каких новых пользователей добавить?

source: All of the answers above are correct.
ru_ru: Все вышеперечисленные ответы верны.

source: All selected sets %1 all students
ru_ru: Все выделенные задания %1 всем студентам

source: All sets %1 all students
ru_ru: Все задания %1 всем студентам

source: All visible sets %1 all students
ru_ru: Все видимые задания %1 всем студентам

source: Answer Date
ru_ru: Дата ответа

source: Answer Preview
ru_ru: Предварительный просмсотр ответа

source: Any changes made below will be reflected in the set for ALL students.
ru_ru: Все сделанные нимже изменения будут отражаться в задании для ВСЕХ студентов.

source: Apply Options
ru_ru: Применить выбранные опции

source: Assign this set to which users?
ru_ru: Кому из пользователей назначить это задание?

source: Assigned Sets
ru_ru: Назначенные задания

source: At least one of the answers above is NOT %1correct.
ru_ru: По крайней мере один из ответов выше НЕ %1 верен.

source: Attempts
ru_ru: Попытки

source: Can't get password record for effective user '%1': %2
ru_ru: Не удается получить пароль данного пользователя "% 1":% 2

source: Can't get password record for user '%1': %2
ru_ru: Не удается получить пароль пользователя "% 1":% 2

source: Change Email Address
ru_ru: Сменить адрес e-mail

source: Change Password
ru_ru: Сменить пароль

source: Changes abandoned
ru_ru: Изменения отменены

source: Changes saved
ru_ru: Изменения сохранены

source: Check Answers
ru_ru: Проверить ответы

source: Checking additional error messages
ru_ru: Проверяются дополнительные сообщения об ошибках

source: Choose visibility of the sets to be affected
ru_ru: Выберите опцию видимое/невидимое для отмеченных заданий

source: Choose which sets to be affected
ru_ru: Выберите задания, к которым это применяется

source: Clear
ru_ru: Очистить

source: Click on the login name to edit individual problem set data, (e.g. due dates) for these students.
ru_ru: Кликните логин студентов для того чтобы задать индивидуальные настройки для этих студентов.

source: Closed
ru_ru: Закрыто

source: Comment
ru_ru: Комментарий

source: Confirm %1's New Password
ru_ru: Подтвердите новый пароль для %1

source: Continue
ru_ru: Продолжить

source: Correct
ru_ru: Верно

source: Couldn't change %1's password: %2
ru_ru: Не удаётся сменить пароль для %1: %2

source: Couldn't change your email address: %1
ru_ru: Не удаётся сменить адрес e-mail для %1

source: Course Info
ru_ru: Сведения о курсе

source: Courses
ru_ru: Курсы

source: Create as what type of set?
ru_ru: Создать как задание какого типа?

source: Delete how many?
ru_ru: Удалить кого?

source: Disable
ru_ru: Отключить

source: Display Options
ru_ru: Опции отображения

source: Download Hardcopy for Selected %plural(%1,Set,Sets)
ru_ru: Скачать печатную версию для %1 заданий

source: Download PDF or TeX Hardcopy for Current Set
ru_ru: Скачать PDF или TeX файл для данного задания

source: Download PDF or TeX Hardcopy for Selected Sets
ru_ru: Скачать PDF оли TeX файл для отмеченных заданий

source: Due Date
ru_ru: Дата закрытия

source: Duplicate this set and name it
ru_ru: Создать копию задания и назвать его

source: Edit
ru_ru: Редактировать

source: Edit All Set Data
ru_ru: Редактировать все настройки задания

source: Edit Assigned Users
ru_ru: Редактировать список студентов, которым назначено задание

source: Edit Problems
ru_ru: Редактировать задачи

source: Edit Set Data
ru_ru: Редактировать настройки задания

source: Edit Which Users?
ru_ru: Кого из пользователей редактировать?

source: Edit this problem
ru_ru: Редактировать данную задачу

source: Edit which sets?
ru_ru: Какие из заданий редактировать?

source: Email Address
ru_ru: Адрес e-mail

source: Email instructor
ru_ru: Написать e-mail инструктору

source: Enable
ru_ru: Включить

source: Enable Reduced Credit
ru_ru: Включить возможность уменьшенных оценок

source: Enable/Disable reduced scoring for selected sets
ru_ru: Включить/выключить возможность получения уменьшенных оценок для отмеченных заданий

source: Enrollment Status
ru_ru: Статус участия

source: Enter filename below
ru_ru: Напечатайте имя файла

source: Enter filenames below
ru_ru: Напечатайте имена файлов

source: Entered
ru_ru: Введено

source: Export selected sets
ru_ru: Экспортировать выделенные задания

source: Export to what kind of file?
ru_ru: Экспортировать в какой файл?

source: Export which sets?
ru_ru: Какие из заданий экспортировать?

source: Export which users?
ru_ru: Кого из пользователей экспортировать?

source: Failed to create new set: %1
ru_ru: Не удаётся слздать новое задание: %1

source: Failed to create new set: no set name specified!
ru_ru: Не укдаётся создать новое задание: не указано название для задания!

source: Failed to duplicate set: %1
ru_ru: Не удалось создать дубликат задания: %1

source: Failed to duplicate set: no set name specified!
ru_ru: Не удалось создать дубликат задания: имя задания не указано!

source: Failed to duplicate set: no set selected for duplication!
ru_ru: Не удалось создать дубликат задания: задания для дублирования не выбрано!

source: Failed to duplicate set: set %1 already exists!
ru_ru: Не удалось создать дубликат задания: задание %1 уже существует!

source: Filename
ru_ru: Имя файла

source: Filter by what text?
ru_ru: По какому тексту ыильтровать?

source: First Name
ru_ru: Имя

source: Give new password to which users?
ru_ru: Кому из пользователей назначить новый пароль?

source: Guest Login
ru_ru: Гостевой вход

source: Hardcopy Header
ru_ru: Заголовок печатной версии залания

source: Hidden
ru_ru: Скрытое

source: Homework Sets
ru_ru: Задания

source: If a password field is left blank, the student's current password will be maintained.
ru_ru: Если поле пароля оставлено пустым, текущий пароль студента останется без изменений.

source: Import from where?
ru_ru: Откуда импортировать?

source: Import how many sets?
ru_ru: Сколько заданий импортировать?

source: Import sets with names
ru_ru: Импортировать задания с именами

source: Import users from what file?
ru_ru: Из какого файла импортировать пользователей?

source: Inactive
ru_ru: Не активен

source: Invalid user ID or password.
ru_ru: Неверный логин или пароль.

source: Last Name
ru_ru: Фамилия

source: Library Browser
ru_ru: Подбор задач

source: Library Browser 2
ru_ru: Подбор задач 2

source: Log In Again
ru_ru: Войти снова

source: Log Out
ru_ru: выйти

source: Logged in as %1.
ru_ru: Вы вошли как %1.

source: Login Info
ru_ru: Информация о вошедшем

source: Login Name
ru_ru: Логин

source: Login Status
ru_ru: Статус вошедшего

source: Main Menu
ru_ru: Главное меню

source: Match on what? (separate multiple IDs with commas)
ru_ru: Совпадение с кем? (разделяйте идентификаторы запятыми)

source: Messages
ru_ru: Сообщения

source: Name
ru_ru: Имя

source: Name the new set
ru_ru: Дайте имя для нового задания

source: New Password
ru_ru: Новый пароль

source: New passwords saved
ru_ru: Новый пароль сохранён

source: Next Problem
ru_ru: Следующая задача

source: No
ru_ru: Нет

source: No change made to any set
ru_ru: Ни одно из заданий не изменено

source: No sets selected for scoring
ru_ru: Не выбраны задания для подсчёта баллов по ним

source: No sets selected for scoring.
ru_ru: Не выбраны задания для подсчёта баллов по ним.

source: No sets shown. Choose one of the options above to list the sets in the course.
ru_ru: Список заданий не отображён. Выберите одну из опций выше для того, чтобы отобразить список заданий в курсе.

source: No students shown. Choose one of the options above to list the students in the course.
ru_ru: Список студентов не отображен. Выберите одну из опций выше для того, чтобы отобразить список студентов в курсе.

source: Not logged in.
ru_ru: Вы не вошли

source: Note
ru_ru: Замечание

source: Open Date
ru_ru: Дата открытия

source: PREVIEW ONLY -- ANSWERS NOT RECORDED
ru_ru: ПРЕДВАРИТЕЛЬНВЙ ПРОСМОТР -- ОТВЕТЫ НЕ ЗАПИСАНЫ

source: Page generated at %1
ru_ru: Страница сгенерирована %1

source: Password
ru_ru: Пароль

source: Permission Level
ru_ru: Уровень допуска

source: Please enter your username and password for %1 below:
ru_ru: Введите ниже Ваш логин и пароль для %1:

source: Please select action to be performed.
ru_ru: Выберите действие, которое будет выполнено.

source: Preview Answers
ru_ru: Предварительный просмотр ответов.

source: Previous Problem
ru_ru: Предыдущая задача

source: Problem %1
ru_ru: Задача %1

source: Problem List
ru_ru: Список задач

source: Problems
ru_ru: Задачи

source: Recitation
ru_ru: Подразделение

source: Reduced Credit %1 for all sets
ru_ru: Уменьшение баллов %1 для всез заданий

source: Reduced Credit %1 for selected sets
ru_ru: Ументшение бкллов %1 для выделенных заданий

source: Reduced Credit %1 for visable sets
ru_ru: Ументшение бкллов %1 для видимых заданий

source: Reduced Credit Disabled
ru_ru: Уменьшение баллов отключено

source: Reduced Credit Enabled
ru_ru: Уменьшение баллов включено

source: Reduced Credit Starts: %1
ru_ru: Начинается уменьшените баллов: %1

source: Remaining
ru_ru: Остаётся

source: Remember Me
ru_ru: Запомнить меня

source: Replace which users?
ru_ru: Кого из пользователей заменить?

source: Report bugs
ru_ru: Сообщить об ошибках

source: Result
ru_ru: Результат

source: Result of last action performed: %1
ru_ru: Результат последнего из выполненых действий: %1

source: Results of last action performed
ru_ru: Результат последнего из выполненых действий

source: Save changes
ru_ru: Сохранить изменения

source: Score which sets?
ru_ru: Посчитать баллы в отношении каких из заданий?

source: Section
ru_ru: Отдел

source: Select all sets
ru_ru: Выбрать все задания

source: Select all users
ru_ru: Выбрать всех пользователей

source: Select an action to perform
ru_ru: Выбрать действите для выполнения

source: Set %1 exists. No set created
ru_ru: Задание %1 уже имеется. Новое задание не создано

source: Set Definition Filename
ru_ru: Имя файла, определяющего задание

source: Set Header
ru_ru: Заголовок задания

source: Set Info
ru_ru: Информация о задании

source: Set List
ru_ru: Список заданий

source: Set Name
ru_ru: Имя задания

source: Sets
ru_ru: Задания

source: Show Hints
ru_ru: Отобразить подсказки

source: Show Past Answers
ru_ru: Отобразить предыдущие ответы

source: Show Solutions
ru_ru: Показать решения

source: Show Which Users?
ru_ru: Кого из пользователей показать

source: Show correct answers
ru_ru: Показать правильные ответы

source: Show which sets?
ru_ru: Какие из заданий отобразить?

source: Show/Hide Site Description
ru_ru: Показать/Скрыть описание сайта

source: Showing %1 out of %2 sets.
ru_ru: Отображено %1 изf %2 заданий.

source: Showing %1 out of %2 users
ru_ru: Отображено %1 из %2 пользователей

source: Site Information
ru_ru: Информация о сайте

source: Sort by
ru_ru: Сортировать по полю

source: Sort by %1 and then by %2
ru_ru: Сортировать сначала по полю %1 и затем по полю %2

source: Status
ru_ru: Статус

source: Stop Acting
ru_ru: Прекратить действие

source: Student ID
ru_ru: ID студента

source: Submit Answers
ru_ru: Отправить ответы

source: Submit Answers for %1
ru_ru: Отправтьь ответы на %1

source: Success
ru_ru: Успешно

source: Successfully created new set %1
ru_ru: Успешно создано новое задание

source: Take %1 test
ru_ru: Выполнить тест %1

source: Take Action!
ru_ru: Выполнить действие!

source: Test Date
ru_ru: Дата тестирования

source: Test Score
ru_ru: Баллы за тестирование

source: The WeBWorK Project
ru_ru: Проект WebWork

source: The answer above is NOT %1correct.
ru_ru: Приведённый выше ответ не %1 верен.

source: The answer above is correct.
ru_ru: Приведённый выше ответ верен.

source: The password you entered in the %1 field does not match your current password. Please retype your current password and try again.
ru_ru: Введённый пароль в поле %1 не совпадает с вашим текущим паролем для . Наберите пароль и попробуйте ещё раз.

source: The passwords you entered in the %1 and %2 fields don't match. Please retype your new password and try again.
ru_ru: Пароли введённые в полях %1 и %2 не совпадают. Наберите пароли попробуйте ещё раз.

source: The selected problem set (%1) is not a valid set for %2
ru_ru: Выбранное задание (%1) не назначено %2

source: Then by
ru_ru: Затем по полю

source: This homework set contains no problems.
ru_ru: Это задане не содержит задач.

source: This homework set is closed.
ru_ru: Это задание закрыто.

source: This homework set is not yet open.
ru_ru: Это задание пока не открыто.

source: This problem will not count towards your grade.
ru_ru: Эта задача не будет засчитана в ваших баллах.

source: This set is %1
ru_ru: Это задание %1

source: Unselect all sets
ru_ru: Отменить выбр всех заданий

source: Unselect all users
ru_ru: Отменить выбор всех пользователей

source: Use System Default
ru_ru: Использовать системные настройки по умолчанию

source: Username
ru_ru: Имя пользователя

source: Users List
ru_ru: Список пользователей

source: Users sorted by %1, then by %2, then by %3
ru_ru: Пользователи упорядовены по полю %1, затем по полю %2, затем по полю %3

source: Viewing temporary file
ru_ru: Отображается временный файл

source: Viewing temporary file:
ru_ru: Отображается временный файл:

source: Visibility
ru_ru: Видимость

source: Visible
ru_ru: Видимое

source: Warning: Deletion destroys all user-related data and is not undoable!
ru_ru: Предупреждаем: Удаление уничтожит все данные пользователя и это действие необратимо!

source: Welcome to WeBWorK!
ru_ru: Добро пожаловать в WebWork!

source: What field should filtered users match on?
ru_ru: По какому из полей сделапть выборку пользователей.

source: Worth
ru_ru: Ценность

source: Yes
ru_ru: Да

source: You are not authorized to access the instructor tools.
ru_ru: У вас нет прав доступа к инструментам инструктора.

source: You are not authorized to modify homework sets.
ru_ru: У вас нет прав доступа для изменения заданий.

source: You are not authorized to modify set definition files.
ru_ru: У вас нет прав доступа для изменения файлов отпределения заданий.

source: You are not authorized to modify student data
ru_ru: У вас нет прав доступа для изменения данных студентов.

source: You are not authorized to perform this action.
ru_ru: У вас нет прав доступа для выполнения этого действия.

source: You cannot delete yourself!
ru_ru: Вы не можете удалить самого себя!

source: You do not have permission to change email addresses.
ru_ru: У вас нет прав доступа для изменения адресов e-mail.

source: You do not have permission to change your password.
ru_ru: У вас нет прав доступа для изменеия Вашего пароля.

source: You have %1 %2 remaining.
ru_ru: У вас осталось %1 %2.

source: You have %negquant(%1,unlimited attempts,attempt,attempts) remaining.
ru_ru: У вас осталось %1 попыток.

source: You have attempted this problem %quant(%1,time,times).
ru_ru: Вы пробовали решить эту задачу %1 раз.

source: You have been logged out of WeBWorK.
ru_ru: Вы вышли из WebWork.

source: You may not change your own password here!
ru_ru: Здесь Вы не можете поменять Ваш собственный пароль.

source: You must specify a user ID.
ru_ru: Надо указать ID пользователя.

source: You received a score of %1 for this attempt.
ru_ru: Вы получили оценку %1 за эту попытку.

source: Your email address has been changed.
ru_ru: Ваш адрес e-mail изменён.

source: Your overall recorded score is %1. %2
ru_ru: Ваш общий итог %1 баллов. %2

source: Your session has timed out due to inactivity. Please log in again.
ru_ru: Ваша сессия закрыта по причине длительного отсутствия обращений к серверу. Пожалуйста, авторизуйтесь повтрно.

source: [edit]
ru_ru: [рндактировать]

source: _CLASSLIST_EDITOR_DESCRIPTION
ru_ru: _ОПИСАНИЕ_РЕДАКТОРА_СПИСКОВ_ПОЛЬЗОВАЕЛЕЙ

source: _EXTERNAL_AUTH_MESSAGE
ru_ru: _СООБЩЕНИЕ_О_ВНЕШНЕЙ_АВТОРИЗАЦИИ

source: _GUEST_LOGIN_MESSAGE
ru_ru: В данном курсе имеется гостевой вход, не требующий логина и пароля.

source: _HMWKSETS_EDITOR_DESCRIPTION
ru_ru: _ОПИСАНИЕ_РЕДАКТОРА_ЗАДАНИЙ

source: _LOGIN_MESSAGE
ru_ru: _СООБЩЕНИЕ_ОБ_АВТОРИЗАЦИИ

source: _REDUCED_CREDIT_MESSAGE_1
ru_ru: _СООБЩЕНИ_ОБ_УМЕНЬШЕНИИ_БАЛЛОВ_1

source: _REDUCED_CREDIT_MESSAGE_2
ru_ru: _СООБЩЕНИ_ОБ_УМЕНЬШЕНИИ_БАЛЛОВ_2

source: _REQUEST_ERROR
ru_ru: _ОШИБКА_ЗАПРОСА

source: a duplicate of the first selected set
ru_ru: дубликат первого из выбраных заданий

source: a new empty set
ru_ru: новое пустое задание

source: a single set
ru_ru: одно задаие

source: all sets
ru_ru: все задания

source: all users
ru_ru: всех пользователей

source: any users
ru_ru: любых пользователей

source: attempt
ru_ru: попытка

source: attempts
ru_ru: попытки

source: changes abandoned
ru_ru: изменение не сохранены

source: changes saved
ru_ru: изменения сохранены

source: closed, answers available
ru_ru: задание закрыто, ответы доступны

source: closed, answers on %1
ru_ru: задание закрыто, ответы будут доступны %1

source: closed, answers recently available
ru_ru: задание закрыто, ответы вскоре будут доступны

source: completed.
ru_ru: завершено.

source: completely
ru_ru: полностью

source: correct
ru_ru: верно

source: deleted %1 sets
ru_ru: удалено %1 заданий

source: deleted %1 users
ru_ru: удалено %1 пользователей

source: editing all sets
ru_ru: редактороваать все задания

source: editing all users
ru_ru: редактировать всех пользователей

source: editing selected sets
ru_ru: редактировать выбранные задания

source: editing selected users
ru_ru: редактировать выбранных пользователей

source: editing visible sets
ru_ru: редактировать видимые задания

source: editing visible users
ru_ru: редактировать видимых пользоваателей

source: enter matching set IDs below
ru_ru: ниже введите ID для требуемых заданий

source: export abandoned
ru_ru: экспортирование отменено

source: exporting all sets
ru_ru: экспортировать все задания

source: exporting selected sets
ru_ru: экспортировать выбранные задания

source: exporting visible sets
ru_ru: экспортировать видимые задания

source: giving new passwords to all users
ru_ru: назначить новый пароль всем пользователям

source: giving new passwords to selected users
ru_ru: назначить новый пароль выбранным пользователям

source: giving new passwords to visible users
ru_ru: назначить новый пароль видимым пользователям

source: hidden
ru_ru: скрыто

source: hidden from students
ru_ru: скрыто от студентов

source: hidden sets
ru_ru: скрытые задания

source: incorrect
ru_ru: неверно

source: multiple sets
ru_ru: множество заданий

source: navNext
ru_ru: След.

source: navNextGrey
ru_ru: След.

source: navPrev
ru_ru: Пред.

source: navPrevGrey
ru_ru: Пред.

source: navProbList
ru_ru: К списку задач

source: navProbListGrey
ru_ru: К списку задач

source: navUp
ru_ru: Вверх

source: no sets
ru_ru: ни одного задания

source: no users
ru_ru: никого из пользователей

source: now open, due
ru_ru: сейчас открыто, закроется

source: open: complete by %1
ru_ru: открыто: завершите решение до %1

source: over time: closed.
ru_ru: истекло время: закрыто.

source: selected sets
ru_ru: выбранные задания

source: selected users
ru_ru: выбранных пользователей

source: showing all sets
ru_ru: оторажены все задания

source: showing all users
ru_ru: отображены все пользователи

source: showing matching users
ru_ru: отображены пользователи, удовлетворяющие критерию выбрки

source: showing no sets
ru_ru: ни одного задания не показано

source: showing no users
ru_ru: ни одного пользователя не показано

source: showing selected sets
ru_ru: отображены выбранные задания

source: showing selected users
ru_ru: отображены выбраные пользователи

source: time
ru_ru: время

source: times
ru_ru: раз

source: unlimited
ru_ru: неогр. кол-во

source: users who match on selected field
ru_ru: пользователи, которые соответствуют условию выборки по выбранному полю

source: visible
ru_ru: видимый

source: visible sets
ru_ru: видимые задания

source: visible to students
ru_ru: выдимы студентам

source: visible users
ru_ru: видимых пользователей

source: will open on %1
ru_ru: откроется %1

source: Add to which set?
ru_ru: В какое из заданий добавить?

source: Course Information for course [_1]
ru_ru: Информация о курсе [_1]

source: report bugs in this problem
ru_ru: сообщить об ошибке в этой задача

source: Problem [_1]
ru_ru: Задача [_1]

source: Cancel Password
ru_ru: Отменить назначение пароля

source: Audit
ru_ru: Аудит

source: Hardcopy Header for set [_1]
ru_ru: Заголовок печатной версии задания [_1]

source: Report bugs in a WeBWorK question/problem using this link. The very first time you do this you will need to register with an email address so that information on the bug fix can be reported back to you.
ru_ru: Сообщить об ошибке в задаче WeBWorK. В первый раз, когда вы сообщаете об ошибке, вам потребуется зарегистрироваться с указанием адреса e-mail, чтобы Вам смогли сообщить об устранении ошибки по этому адресу.

source: Pad Fields
ru_ru: Заполненые поля

source: Set Header for set [_1]
ru_ru: Заголовок задания для [_1]

source: Statistics for [_1]
ru_ru: Статистика для [_1]

source: Filter
ru_ru: Фильтр

source: set [_1]/problem [_2]
ru_ru: задание [_1]/задача [_2]

source: You are not authorized to modify problems.
ru_ru: У вас нет прав доступа для изменения задач.

source: hardcopy header file
ru_ru: файл заголовка для печетной версии задания

source: Write permissions have not been enabled in the templates directory. No changes can be made.
ru_ru: Папка templates закрыта для записи. Изменения не могут быть записаны.

source: Save [_1] and View
ru_ru: Сохранить [_1] и просмотреть

source: Create
ru_ru: Создать

source: Changes in this file have not yet been permanently saved.
ru_ru: Изменения в этом файле ещё не были сохранены.

source: Instructor Tools
ru_ru: Инструменты инструктора

source: Score
ru_ru: Баллы

source: Show in another window
ru_ru: Показать в другом окне

source: Copied auxiliary files from [_1] to new location at [_2]
ru_ru: Вспомогательные файлы скопированы из [_1] в новое место [_2]

source: Unpublished
ru_ru: Не опубликовано

source: Login
ru_ru: Логин

source: File Manager
ru_ru: Менеджер файлов
