Repository: some14ever/webwork2
Catalog: lib/WeBWorK/Localize/*.po
Languages: ru_ru

source: Unable to change the hardcopy header for set [_1]. Unknown error.
ru_ru: Не удалось изменить заголовок печатной версии для задания [_1]. Причина ошибки неизвестна.

source: Unable to make '[_1]' the set header for [_2]
ru_ru: Не удалсь сделать '[_1]' заголовком задания для [_2]

source: Can't determine user of temporary edit file [_1].
ru_ru: Не удалось установить принадлежность временного файла [_1].

source: Download a hardcopy of this homework set.
ru_ru: Загрузить печатную версию этого задания.

source: Problem Editor
ru_ru: Редактор задач

source: The file '[_1]' is protected!
ru_ru: Файл '[_1]' зашищён от записи!

source: Top level of author information on the wiki.
ru_ru: Верхний уровень информации об авторе в wiki.

source: Score selected set(s) and save to:
ru_ru: Выставить баллы по выбранным заданиям и согранить их в:

source: Save Password
ru_ru: Сохранить пароль

source: The file '[_1]' is a blank problem!
ru_ru: Файл '[_1]' это пустая задача!

source: Add as what filetype?
ru_ru: Дрбавить как файл какого типа?

source: no action
ru_ru: бездействие

source: Added '[_1]' to [_2] as new set header
ru_ru: '[_1]' добавлен к [_2] в качестве заголовка задания

source: View statistics by set
ru_ru: Посмотреть статистику по заданию

source: Set
ru_ru: Задание

source: This is a blank problem template file and can not be edited directly. Use the 'Save as' action below to create a local copy of the file and add it to the current problem set.
ru_ru: Это файо шаблона для задачи, его нелтзя редактировать напрямую. Выполните коменду 'сохранить как' ниже для того, чтобы изготовить локальную копию задачи и добавить её к текущему заданию.

source: Logout
ru_ru: Выйти

source: You do not have permission to view the details of this error.
ru_ru: У вас нет оазрешений посмотреть детали этой ошибки.

source: Reverting to original file '[_1]'
ru_ru: Вернуться к исходному файлу '[_1]'

source: Delete
ru_ru: Удалить

source: Wiki summary page for MathObjects
ru_ru: Резюмирующая страничка wiki по объектам MathObjects

source: Your score was recorded.
ru_ru: Ваши баллы записаны

source: You must specify an file name in order to save a new file.
ru_ru: Вам надо указать имя файла для того, чтобы сохранить новый файл.

source: To edit this text you must first make a copy of this file using the 'Save as' action below.
ru_ru: Для того, чтобы редактировать этот текст, надо создать копию файла, выполнив действие 'Сохранить как' ниже.

source: unassigned problem file
ru_ru: не назначенный файл задачи

source: View statistics by student
ru_ru: Посмотреть статистику по студентам

source: Publish
ru_ru: Опубликовать

source: Password/Email
ru_ru: Пароль/e-mail

source: Cancel Edit
ru_ru: Отменить редактирование

source: Snippets of PG code illustrating specific techniques
ru_ru: Фрагменты PG кода, иллюстрирующие отдельные методы программирования

source: Error copying [_1] to [_2]
ru_ru: Ошибка при копировании [_1] в [_2]

source: Hmwk Sets Editor
ru_ru: Редактор заданий

source: This set is [_1] students.
ru_ru: Это задание для студентов [_1].

source: header file
ru_ru: файл заголовка

source: Include Index
ru_ru: Включить оглавление

source: Display Mode
ru_ru: Способ отображения

source: You can earn partial credit on this problem.
ru_ru: Балл за эту задачу может дробиться.

source: Write permissions have not been enabled in '[_1]'. Changes must be saved to a different directory for viewing.
ru_ru: Папка '[_1]' защищена от записи. Изменения должны быть записаны в другую папку для посмотра.

source: blank problem
ru_ru: пустая задача

source: Save Edit
ru_ru: Сохранить изменения

source: Enrolled
ru_ru: Включен в списки

source: Write permissions have not been enabled for '[_1]'. Changes must be saved to another file for viewing.
ru_ru: Файл '[_1]' защищён от записи. Изменения должны быть сохранены в другой файл для просмотра.

source: Note: this problem viewer is for viewing purposes only. As of right now, testing functionality is not possible.
ru_ru: Замечание: этот редактор предназначен только для просмотра задач. Проверка работоспособности задачи на данный момент в нём не предусмотрена.

source: Save Export
ru_ru: Сохранить экспортируемое

source: Problem Viewer
ru_ru: Просмотр задач

source: submit button clicked
ru_ru: нажата кнопка отправить

source: Student Progress for [_1]
ru_ru: Текущие результаты студентов по [_1]

source: A new file has been created at '[_1]' with the contents below. No changes have been made to set [_2].
ru_ru: Новый файл был создан в папке '[_1]', егр содержание ниже. Никаких изменений в задание [_2] не внесено.

source: Your score was not recorded because this problem has not been assigned to you.
ru_ru: Ваши баллы не записаны, поскольку эта задача вам не назначена.

source: Sort
ru_ru: Сортировать

source: Add problem
ru_ru: Добавить задачу

source: Author Info
ru_ru: Информация об авторе

source: Replace [_1]
ru_ru: Заменить [_1]

source: Help
ru_ru: Помощь

source: Add Users
ru_ru: Добавить пользователей

source: Problem Source Code
ru_ru: Исходный код задачи

source: Test snippets of PG code in interactive lab. Good way to learn PG language.
ru_ru: Испытайте образцы PG кода в интерактивной лаборатории. Это хороший способ изучить язык программирования PG.

source: Page generated at [_1] at [_2]
ru_ru: Страничка сгенерирована [_1] [_2]

source: Import
ru_ru: Импортировать

source: View Using Seed Number
ru_ru: Просмотреть, используя генератор случайных чисел с базовым числом

source: Grades
ru_ru: Баллы

source: Published
ru_ru: Опукбликовано

source: Your score was not recorded because this homework set is closed.
ru_ru: Ваши баллы не записаны, поскольку задание закрыто.

source: The text box now contains the source of the original problem. You can recover lost edits by using the Back button on your browser.
ru_ru: Текстовое окно теперь содержит код исходной задачи. Вы можете восстановить сделанные ранее изменения при момощи кнопки Назад в Вашем браузере.

source: The file '[_1]' is a directory!
ru_ru: Afqk '[_1]' является папкой!

source: Save As
ru_ru: Сохранить как

source: Documentation from source code for PG modules and macro files. Often the most up-to-date information.
ru_ru: Документация из исходных кеодов PG модулей и макрофайлов. Часто это самая свежая информация по теме.

source: Problem Techniques
ru_ru: Техника программирования задач.

source: Course Configuration
ru_ru: Конфигурация курса.

source: Feedback
ru_ru: Обратная связь

source: Export
ru_ru: Экспортировать

source: PG mark down syntax used to format WeBWorK questions. This interactive lab can help you to learn the techniques.
ru_ru: Язык разметки PG использован для отображения задач в WebWork. Интерактивная лаборатрия может помочь Вам изучить этот язык.

source: Record Scores for Single Sets
ru_ru: Записать баллы для отдельных заданий

source: Append to end of set [_1]
ru_ru: Дописать в конец задания [_1]

source: Unrecognized saveMode: |[_1]|. Unknown error.
ru_ru: Неопознанная saveMode: |[_1]|. Причина ошибки неизвестна.

source: Your score was not recorded because there was a failure in storing the problem record to the database.
ru_ru: Ваши баллы не записаны, поскольку произошла ошибка при сохранении результатов по задаче в базу данных.

source: The hardcopy header for set [_1] has been renamed to '[_2]'.
ru_ru: Заголовок задания [_1] был переименован в '[_2]'.

source: Save as
ru_ru: Сохранить как

source: Select action below
ru_ru: Выбарите действие нмже

source: The file '[_1]' cannot be found.
ru_ru: Файл '[_1]' не найден.

source: Unable to write to '[_1]': [_2]
ru_ru: Не удалось записать в '[_1]': [_2]

source: Save
ru_ru: Сохранить

source: File '[_1]' exists. File not saved. No changes have been made. You can change the file path for this problem manually from the 'Hmwk Sets Editor' page
ru_ru: Файл '[_1]' существует. Файл не был сохранён. Никаких изменений в нём не производилось. Вы можете изменить путь к файлу для этой задачи вручную из редактора заданий

source: The set header for set [_1] has been renamed to '[_2]'.
ru_ru: Заголовок для задания [_1] был перпеименован в '[_2]'.

source: Error: This path is already in the temporary edit directory -- no new temporary file is created. path = [_1]
ru_ru: Ошибка: Этот путь указывает внурть папки временных редактирований -- новых временных файлов не создано. Путь = [_1]

source: Please use radio buttons to choose the method for saving this file. Can't recognize saveMode: |[_1]|.
ru_ru: Используйте кнопки выбора для того, чтобы выбрать способ сохранения этого файла. НЕ удалось распознать saveMode: |[_1]|.

source: Saved to file '[_1]'
ru_ru: Сохранени в файл '[_1]'

source: Please specify a file to save to.
ru_ru: Укажите файл, в который следует сохранитиь.

source: The selected problem ([_1]) is not a valid problem for set [_2].
ru_ru: Выбранная задача ([_1]) не является корректной для задания [_2].

source: Editing [_1] in file '[_2]'
ru_ru: Редактирование [_1] в файле '[_2]'

source: Deleting temp file at [_1]
ru_ru: Удаляется временый файл в [_1]

source: hidden from
ru_ru: скрыто от

source: View student progress by set
ru_ru: Просмотреть текущие результаты студентов по заданиям

source: View
ru_ru: Просмотреть

source: Resources
ru_ru: Ресурсы

source: Scoring Download
ru_ru: Скачать баллы

source: Duplicate
ru_ru: Создать дубликат

source: This path |[_1]| is not the path to a temporary edit file.
ru_ru: Путь |[_1]| не является путём к файлу временного редактирования.

source: visible to
ru_ru: виден

source: Unable to change the source file path for set [_1], problem [_2]. Unknown error.
ru_ru: Не удаётся изменить путь к задаче [_2] в задании [_1]. Неизвестная ошибка.

source: Course Administration
ru_ru: Администрирование курса

source: Added [_1] to [_2] as problem [_3]
ru_ru: Задача [_1] добавлена в задание [_2] как хадача [_3]

source: Options Information
ru_ru: Информация об опциях

source: Proctor
ru_ru: Смотритель

source: Student Progress
ru_ru: Результаты студентов

source: Revert
ru_ru: Вернуть

source: Statistics
ru_ru: Статистика

source: Save as new independent problem
ru_ru: Сохранить как новую отдельную задачу

source: Scoring Tools
ru_ru: Инструменты для подсчёта баллов

source: The source file for 'set [_1] / problem [_2]' has been changed from [_3] to '[_4]'.
ru_ru: Исходный файл для задачи [_2] из задания [_1] был изменён с [_3] на '[_4]'.

source: Cancel Export
ru_ru: Отменить экспортирование

source: View student progress by student
ru_ru: Просмотреть результаты по студентам

source: Revert to [_1]
ru_ru: Вернуться к [_1]

source: Classlist Editor
ru_ru: Редактор списка пользователей

source: Add
ru_ru: Добавить

source: the original path to the file is [_1]
ru_ru: первоначальный путь к файлу - это [_1]

source: The path to the original file should be absolute
ru_ru: Путь к первоначальному файлу должен быть абсолютным

source: To edit this text you must use the 'Save AS' action below to save it to another file.
ru_ru: Для редактирования этого текстанадо выполнить действте 'Сохранить как' ниже и сохранить его в другой файл.

source: Error: The original file [_1] cannot be read.
ru_ru: Ошибка: Первоначсальный файл [_1] не удаётся прочесть.

source: Unable to change the set header for set [_1]. Unknown error.
ru_ru: Не удалось изменить заголовок для задания [_1]. Неизвестная ошибка.

source: options information
ru_ru: информация об опциях

source: The selected problem([_1]) is not a valid problem for set [_2].
ru_ru: Выбранная задача [_1] не является корректной задачей ждя задания [_2].

source: Unknown file type
ru_ru: Неизвестный тип файла

source: course information
ru_ru: информация о курсе

source: Change User Options
ru_ru: Изменить опции пользователя

source: Drop
ru_ru: Пропустить

source: Solutions
ru_ru: Решения

source: Show:
ru_ru: Показать:

source: WeBWorK Assignment [_1] is due : [_2].
ru_ru: Задание WeBWorK [_1] закрыто: [_2].

source: Hardcopy Generator
ru_ru: Генератор печатных версий

source: This set is visible to students.
ru_ru: Это задание видимо для студентов

source: View equations as
ru_ru: Просматривать уравнения как

source: From:
ru_ru: От:

source: Generate Hardcopy
ru_ru: Создать печатную версию

source: You may choose to show any of the following data. Correct answers and solutions are only available after the answer date of the homework set.
ru_ru: Вы можете выбрать любое из следующих данных. Верные ответы и решения могут быть доступны только после даты закрытия задания.

source: E-mail Instructor
ru_ru: Написать e-mail инструктору

source: Send E-mail:
ru_ru: Отправить e-mail:

source: Cancel Email
ru_ru: Отменить отправку e-mail

source: Correct answers
ru_ru: Правильные ответы

source: Use this form to report to your professor a problem with the WeBWorK system or an error in a problem you are attempting. Along with your message, additional information about the state of the system will be included.
ru_ru: Используйте эту форму для того, чтобы сообщить вашему преподавателю об ошибке в работе системы WebWork или об ошибке в задаче. Вместе с этим сообщением будет отправлена дополнительная информация о состоянии системы.

source: Student answers
ru_ru: Ответы студента

source: Hints
ru_ru: Подсказки

source: Hardcopy Format:
ru_ru: Формат печатной версии:
